porousVent/benchmark_perforatedTiles/SHM_source/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    (24.200000000000003 10.4 0)
    (38.2 10.4 0)
    (38.2 17.8 0)
    (24.200000000000003 17.8 0)
    (24.200000000000003 10.4 4.4)   
    (38.2 10.4 4.4)  
    (38.2 17.8 4.4)    
    (24.200000000000003 17.8 4.4)   
);

  // Need to be round as an Interger, I've failed to code that.

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 37 22) simpleGrading (1 1 1)  
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (0 4 7 3)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
