porousVent/benchmark_perforatedTiles/SHM_source/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

62
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2080;
        startFace       214657;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2080;
        startFace       216737;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4268;
        startFace       218817;
    }
    rack1B4CBD4A994E6797F70F5EF1F5863DB2_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack1B4CBD4A994E6797F70F5EF1F5863DB2
wall
)
;
        nFaces          256;
        startFace       223085;
    }
    rack1B4CBD4A994E6797F70F5EF1F5863DB2_inlet
    {
        type            patch;
        inGroups        1(rack1B4CBD4A994E6797F70F5EF1F5863DB2);
        nFaces          120;
        startFace       223341;
    }
    rack1B4CBD4A994E6797F70F5EF1F5863DB2_outlet
    {
        type            patch;
        inGroups        1(rack1B4CBD4A994E6797F70F5EF1F5863DB2);
        nFaces          120;
        startFace       223461;
    }
    rackFA1BFEC6E1E22133740F019445868403_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackFA1BFEC6E1E22133740F019445868403
wall
)
;
        nFaces          96;
        startFace       223581;
    }
    rackFA1BFEC6E1E22133740F019445868403_inlet
    {
        type            patch;
        inGroups        1(rackFA1BFEC6E1E22133740F019445868403);
        nFaces          120;
        startFace       223677;
    }
    rackFA1BFEC6E1E22133740F019445868403_outlet
    {
        type            patch;
        inGroups        1(rackFA1BFEC6E1E22133740F019445868403);
        nFaces          120;
        startFace       223797;
    }
    rack927D2E6888FD177A981C0A7DD98F9854_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack927D2E6888FD177A981C0A7DD98F9854
wall
)
;
        nFaces          96;
        startFace       223917;
    }
    rack927D2E6888FD177A981C0A7DD98F9854_inlet
    {
        type            patch;
        inGroups        1(rack927D2E6888FD177A981C0A7DD98F9854);
        nFaces          120;
        startFace       224013;
    }
    rack927D2E6888FD177A981C0A7DD98F9854_outlet
    {
        type            patch;
        inGroups        1(rack927D2E6888FD177A981C0A7DD98F9854);
        nFaces          120;
        startFace       224133;
    }
    rackC65181F2388B717A2DFA3CA4F31EBB92_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackC65181F2388B717A2DFA3CA4F31EBB92
wall
)
;
        nFaces          256;
        startFace       224253;
    }
    rackC65181F2388B717A2DFA3CA4F31EBB92_inlet
    {
        type            patch;
        inGroups        1(rackC65181F2388B717A2DFA3CA4F31EBB92);
        nFaces          120;
        startFace       224509;
    }
    rackC65181F2388B717A2DFA3CA4F31EBB92_outlet
    {
        type            patch;
        inGroups        1(rackC65181F2388B717A2DFA3CA4F31EBB92);
        nFaces          120;
        startFace       224629;
    }
    rack4A95D65ACB30A998A736CBDCEE88E685_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack4A95D65ACB30A998A736CBDCEE88E685
wall
)
;
        nFaces          256;
        startFace       224749;
    }
    rack4A95D65ACB30A998A736CBDCEE88E685_outlet
    {
        type            patch;
        inGroups        1(rack4A95D65ACB30A998A736CBDCEE88E685);
        nFaces          120;
        startFace       225005;
    }
    rack4A95D65ACB30A998A736CBDCEE88E685_inlet
    {
        type            patch;
        inGroups        1(rack4A95D65ACB30A998A736CBDCEE88E685);
        nFaces          120;
        startFace       225125;
    }
    rack854D7BA836DCDC8D61AD830338297BA9_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack854D7BA836DCDC8D61AD830338297BA9
wall
)
;
        nFaces          96;
        startFace       225245;
    }
    rack854D7BA836DCDC8D61AD830338297BA9_outlet
    {
        type            patch;
        inGroups        1(rack854D7BA836DCDC8D61AD830338297BA9);
        nFaces          120;
        startFace       225341;
    }
    rack854D7BA836DCDC8D61AD830338297BA9_inlet
    {
        type            patch;
        inGroups        1(rack854D7BA836DCDC8D61AD830338297BA9);
        nFaces          120;
        startFace       225461;
    }
    rack0E1B92A4DE590895AB323DD8D1E9F921_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack0E1B92A4DE590895AB323DD8D1E9F921
wall
)
;
        nFaces          256;
        startFace       225581;
    }
    rack0E1B92A4DE590895AB323DD8D1E9F921_outlet
    {
        type            patch;
        inGroups        1(rack0E1B92A4DE590895AB323DD8D1E9F921);
        nFaces          120;
        startFace       225837;
    }
    rack0E1B92A4DE590895AB323DD8D1E9F921_inlet
    {
        type            patch;
        inGroups        1(rack0E1B92A4DE590895AB323DD8D1E9F921);
        nFaces          120;
        startFace       225957;
    }
    rackEA7E369EEC67CD4825F99F786002F8BB_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackEA7E369EEC67CD4825F99F786002F8BB
wall
)
;
        nFaces          96;
        startFace       226077;
    }
    rackEA7E369EEC67CD4825F99F786002F8BB_outlet
    {
        type            patch;
        inGroups        1(rackEA7E369EEC67CD4825F99F786002F8BB);
        nFaces          120;
        startFace       226173;
    }
    rackEA7E369EEC67CD4825F99F786002F8BB_inlet
    {
        type            patch;
        inGroups        1(rackEA7E369EEC67CD4825F99F786002F8BB);
        nFaces          120;
        startFace       226293;
    }
    rackE1B88BE09859F2B90B67530927011F46_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackE1B88BE09859F2B90B67530927011F46
wall
)
;
        nFaces          256;
        startFace       226413;
    }
    rackE1B88BE09859F2B90B67530927011F46_inlet
    {
        type            patch;
        inGroups        1(rackE1B88BE09859F2B90B67530927011F46);
        nFaces          120;
        startFace       226669;
    }
    rackE1B88BE09859F2B90B67530927011F46_outlet
    {
        type            patch;
        inGroups        1(rackE1B88BE09859F2B90B67530927011F46);
        nFaces          120;
        startFace       226789;
    }
    rack6F2FB4401216FB0BE5B3E9FA249DE9D5_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack6F2FB4401216FB0BE5B3E9FA249DE9D5
wall
)
;
        nFaces          96;
        startFace       226909;
    }
    rack6F2FB4401216FB0BE5B3E9FA249DE9D5_inlet
    {
        type            patch;
        inGroups        1(rack6F2FB4401216FB0BE5B3E9FA249DE9D5);
        nFaces          120;
        startFace       227005;
    }
    rack6F2FB4401216FB0BE5B3E9FA249DE9D5_outlet
    {
        type            patch;
        inGroups        1(rack6F2FB4401216FB0BE5B3E9FA249DE9D5);
        nFaces          120;
        startFace       227125;
    }
    rackCB8BB049ED5D9C7579939A35E238AE7C_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackCB8BB049ED5D9C7579939A35E238AE7C
wall
)
;
        nFaces          96;
        startFace       227245;
    }
    rackCB8BB049ED5D9C7579939A35E238AE7C_inlet
    {
        type            patch;
        inGroups        1(rackCB8BB049ED5D9C7579939A35E238AE7C);
        nFaces          120;
        startFace       227341;
    }
    rackCB8BB049ED5D9C7579939A35E238AE7C_outlet
    {
        type            patch;
        inGroups        1(rackCB8BB049ED5D9C7579939A35E238AE7C);
        nFaces          120;
        startFace       227461;
    }
    rack7CE29452499711B0CDDF74AF35D57FA0_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack7CE29452499711B0CDDF74AF35D57FA0
wall
)
;
        nFaces          256;
        startFace       227581;
    }
    rack7CE29452499711B0CDDF74AF35D57FA0_inlet
    {
        type            patch;
        inGroups        1(rack7CE29452499711B0CDDF74AF35D57FA0);
        nFaces          120;
        startFace       227837;
    }
    rack7CE29452499711B0CDDF74AF35D57FA0_outlet
    {
        type            patch;
        inGroups        1(rack7CE29452499711B0CDDF74AF35D57FA0);
        nFaces          120;
        startFace       227957;
    }
    rackCFEA7F02580F13637EC4158DF376E6A1_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackCFEA7F02580F13637EC4158DF376E6A1
wall
)
;
        nFaces          256;
        startFace       228077;
    }
    rackCFEA7F02580F13637EC4158DF376E6A1_outlet
    {
        type            patch;
        inGroups        1(rackCFEA7F02580F13637EC4158DF376E6A1);
        nFaces          120;
        startFace       228333;
    }
    rackCFEA7F02580F13637EC4158DF376E6A1_inlet
    {
        type            patch;
        inGroups        1(rackCFEA7F02580F13637EC4158DF376E6A1);
        nFaces          120;
        startFace       228453;
    }
    rackEDC8F6013BD80A7E069B3B7DBF87465F_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackEDC8F6013BD80A7E069B3B7DBF87465F
wall
)
;
        nFaces          96;
        startFace       228573;
    }
    rackEDC8F6013BD80A7E069B3B7DBF87465F_outlet
    {
        type            patch;
        inGroups        1(rackEDC8F6013BD80A7E069B3B7DBF87465F);
        nFaces          120;
        startFace       228669;
    }
    rackEDC8F6013BD80A7E069B3B7DBF87465F_inlet
    {
        type            patch;
        inGroups        1(rackEDC8F6013BD80A7E069B3B7DBF87465F);
        nFaces          120;
        startFace       228789;
    }
    rack36DD04A52BFE5C6B041452059D458836_fixedWall
    {
        type            wall;
        inGroups        
2
(
rack36DD04A52BFE5C6B041452059D458836
wall
)
;
        nFaces          256;
        startFace       228909;
    }
    rack36DD04A52BFE5C6B041452059D458836_outlet
    {
        type            patch;
        inGroups        1(rack36DD04A52BFE5C6B041452059D458836);
        nFaces          120;
        startFace       229165;
    }
    rack36DD04A52BFE5C6B041452059D458836_inlet
    {
        type            patch;
        inGroups        1(rack36DD04A52BFE5C6B041452059D458836);
        nFaces          120;
        startFace       229285;
    }
    rackD902EEF5E6F996BB25E50FDE8FD1F62B_fixedWall
    {
        type            wall;
        inGroups        
2
(
rackD902EEF5E6F996BB25E50FDE8FD1F62B
wall
)
;
        nFaces          96;
        startFace       229405;
    }
    rackD902EEF5E6F996BB25E50FDE8FD1F62B_outlet
    {
        type            patch;
        inGroups        1(rackD902EEF5E6F996BB25E50FDE8FD1F62B);
        nFaces          120;
        startFace       229501;
    }
    rackD902EEF5E6F996BB25E50FDE8FD1F62B_inlet
    {
        type            patch;
        inGroups        1(rackD902EEF5E6F996BB25E50FDE8FD1F62B);
        nFaces          120;
        startFace       229621;
    }
    acuF9CB05DA6465C302727AC2126F3ADC50_inlet
    {
        type            patch;
        inGroups        1(acuF9CB05DA6465C302727AC2126F3ADC50);
        nFaces          40;
        startFace       229741;
    }
    acuF9CB05DA6465C302727AC2126F3ADC50_outlet
    {
        type            patch;
        inGroups        1(acuF9CB05DA6465C302727AC2126F3ADC50);
        nFaces          40;
        startFace       229781;
    }
    acuF9CB05DA6465C302727AC2126F3ADC50_fixedWall
    {
        type            wall;
        inGroups        
2
(
acuF9CB05DA6465C302727AC2126F3ADC50
wall
)
;
        nFaces          280;
        startFace       229821;
    }
    acu1385ECEC5AC66642155584A8F60EB282_inlet
    {
        type            patch;
        inGroups        1(acu1385ECEC5AC66642155584A8F60EB282);
        nFaces          40;
        startFace       230101;
    }
    acu1385ECEC5AC66642155584A8F60EB282_outlet
    {
        type            patch;
        inGroups        1(acu1385ECEC5AC66642155584A8F60EB282);
        nFaces          40;
        startFace       230141;
    }
    acu1385ECEC5AC66642155584A8F60EB282_fixedWall
    {
        type            wall;
        inGroups        
2
(
acu1385ECEC5AC66642155584A8F60EB282
wall
)
;
        nFaces          280;
        startFace       230181;
    }
    acu58D3207FC902F3CCC0F4E3EA1FA1DBE2_inlet
    {
        type            patch;
        inGroups        1(acu58D3207FC902F3CCC0F4E3EA1FA1DBE2);
        nFaces          40;
        startFace       230461;
    }
    acu58D3207FC902F3CCC0F4E3EA1FA1DBE2_outlet
    {
        type            patch;
        inGroups        1(acu58D3207FC902F3CCC0F4E3EA1FA1DBE2);
        nFaces          40;
        startFace       230501;
    }
    acu58D3207FC902F3CCC0F4E3EA1FA1DBE2_fixedWall
    {
        type            wall;
        inGroups        
2
(
acu58D3207FC902F3CCC0F4E3EA1FA1DBE2
wall
)
;
        nFaces          280;
        startFace       230541;
    }
    baffleFaces_master
    {
        type            wall;
        inGroups        
2
(
wall
baffleFaces
)
;
        nFaces          5789;
        startFace       230821;
    }
    baffleFaces_slave
    {
        type            wall;
        inGroups        
2
(
wall
baffleFaces
)
;
        nFaces          5789;
        startFace       236610;
    }
)

// ************************************************************************* //
