porousVent/benchmark_perforatedTiles/SHM_source/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;
surfaceFormat raw;
interpolationScheme cellPoint;

fields
(
    T
    p
);

surfaces
(
    lowSlice
    {
        type            plane;
        basePoint       (0 0 1);
        normalVector    (0 0 1);
        interpolate	true;
    }

    underfloorSlice
    {
        type            plane;
        basePoint       (0 0 0.4);
        normalVector    (0 0 1);
        interpolate	true;
    }
);


// *********************************************************************** //