porousVent/benchmark_perforatedTiles/SHM_source/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name inside;
        type cellSet;
        action new;
        source surfaceToCell;
        sourceInfo
        {
            file "constant/triSurface/room_boundary.stl";
            outsidePoints ((24.200000000000003 10.4 0));
            includeCut false;
            includeInside true;
            includeOutside false;
            nearDistance -1;
            curvature -100;
        }
    }

    {
      name    baffleFaces;
      type    faceSet;
      action  new;
      source  boxToFace;
      sourceInfo
      {
          box (24.200000000000003 10.4 0.59)(38.2 17.8 0.61);
      }
    }
    {
      name    baffleFaces;
      type    faceSet;
      action  add;
      source  boxToFace;
      sourceInfo
      {
          box (24.200000000000003 10.4 0.79)(38.2 17.8 0.81);
      }
    }

        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (28.8 13.200000000000001 0.59)(29.400000000000002 13.8 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (28.8 13.200000000000001 0.79)(29.400000000000002 13.8 0.81);
      }
    }

        {
      name    floorvent2A1BA98D742BDB1FC147B2CA43F835C0;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (28.8 13.200000000000001 0.6)(29.400000000000002 13.8 0.8);
      }
    }
    {
    name floorvent2A1BA98D742BDB1FC147B2CA43F835C0;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorvent2A1BA98D742BDB1FC147B2CA43F835C0;
    }
}
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (29.400000000000002 13.8 0.59)(30.0 14.4 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (29.400000000000002 13.8 0.79)(30.0 14.4 0.81);
      }
    }

        {
      name    floorventB8FDC6307B84613EDE9F3D1266FBF2A7;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (29.400000000000002 13.8 0.6)(30.0 14.4 0.8);
      }
    }
    {
    name floorventB8FDC6307B84613EDE9F3D1266FBF2A7;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorventB8FDC6307B84613EDE9F3D1266FBF2A7;
    }
}
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (28.8 14.4 0.59)(29.400000000000002 15.0 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (28.8 14.4 0.79)(29.400000000000002 15.0 0.81);
      }
    }

        {
      name    floorvent7F94527B35F3B71B1E712CEE6AA4B6D4;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (28.8 14.4 0.6)(29.400000000000002 15.0 0.8);
      }
    }
    {
    name floorvent7F94527B35F3B71B1E712CEE6AA4B6D4;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorvent7F94527B35F3B71B1E712CEE6AA4B6D4;
    }
}
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (29.400000000000002 15.0 0.59)(30.0 15.600000000000001 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (29.400000000000002 15.0 0.79)(30.0 15.600000000000001 0.81);
      }
    }

        {
      name    floorventAAC985E7E23E4F7AC0AA5AE9FB1F7A54;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (29.400000000000002 15.0 0.6)(30.0 15.600000000000001 0.8);
      }
    }
    {
    name floorventAAC985E7E23E4F7AC0AA5AE9FB1F7A54;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorventAAC985E7E23E4F7AC0AA5AE9FB1F7A54;
    }
}
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (33.6 13.200000000000001 0.59)(34.2 13.8 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (33.6 13.200000000000001 0.79)(34.2 13.8 0.81);
      }
    }

        {
      name    floorventEA7630CBB9BBFDC6622C7CB948804950;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (33.6 13.200000000000001 0.6)(34.2 13.8 0.8);
      }
    }
    {
    name floorventEA7630CBB9BBFDC6622C7CB948804950;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorventEA7630CBB9BBFDC6622C7CB948804950;
    }
}
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (34.2 13.8 0.59)(34.800000000000004 14.4 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (34.2 13.8 0.79)(34.800000000000004 14.4 0.81);
      }
    }

        {
      name    floorvent3D414218072AA23BD952F9DD06BF64D0;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (34.2 13.8 0.6)(34.800000000000004 14.4 0.8);
      }
    }
    {
    name floorvent3D414218072AA23BD952F9DD06BF64D0;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorvent3D414218072AA23BD952F9DD06BF64D0;
    }
}
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (33.6 14.4 0.59)(34.2 15.0 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (33.6 14.4 0.79)(34.2 15.0 0.81);
      }
    }

        {
      name    floorventFDCCECD400EAA1B4B398E7CC9310D0A5;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (33.6 14.4 0.6)(34.2 15.0 0.8);
      }
    }
    {
    name floorventFDCCECD400EAA1B4B398E7CC9310D0A5;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorventFDCCECD400EAA1B4B398E7CC9310D0A5;
    }
}
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (34.2 15.0 0.59)(34.800000000000004 15.600000000000001 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (34.2 15.0 0.79)(34.800000000000004 15.600000000000001 0.81);
      }
    }

        {
      name    floorventE53508F51655D8FD70DA555E8170559C;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (34.2 15.0 0.6)(34.800000000000004 15.600000000000001 0.8);
      }
    }
    {
    name floorventE53508F51655D8FD70DA555E8170559C;
    type cellZoneSet;
    action new;
    source setToCellZone;
    sourceInfo
    {
        set floorventE53508F51655D8FD70DA555E8170559C;
    }
}


































        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (28.400000000000002 11.200000000000001 0.59)(30.400000000000002 12.0 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (28.400000000000002 11.200000000000001 0.79)(30.400000000000002 12.0 0.81);
      }
    }

        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (33.2 11.200000000000001 0.59)(35.2 12.0 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (33.2 11.200000000000001 0.79)(35.2 12.0 0.81);
      }
    }

        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (25.0 13.4 0.59)(25.8 15.4 0.61);
      }
    }
        {
      name    baffleFaces;
      type    faceSet;
      action  delete;
      source  boxToFace;
      sourceInfo
      {
          box (25.0 13.4 0.79)(25.8 15.4 0.81);
      }
    }


{
    name baffleFaces;
    type faceZoneSet;
    action new;
    source setToFaceZone;
    sourceInfo
    {
        faceSet baffleFaces;
    }
}

);