porousVent/benchmark_perforatedTiles/SHM_source/Allrun
#!/bin/sh

cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


runApplication blockMesh -dict system/blockMeshDict
runApplication surfaceFeatureExtract
runApplication snappyHexMesh -overwrite
runApplication topoSet
runApplication subsetMesh -overwrite -patch fixedWalls inside
runApplication createBaffles -overwrite
#runApplication buoyantBoussinesqSimpleFoam

runApplication decomposePar
runApplication mpirun -np 7 buoyantBoussinesqSimpleFoam -parallel
runApplication reconstructPar

